# Test of KNN

In [2]:
import pandas as pd

In [4]:
base = pd.read_csv("drinks.csv")

In [5]:
base.shape

(193, 5)

In [6]:
base.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

### Input

In [7]:
X = base.iloc[:, 1:]

In [8]:
X

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,0,0,0,0.0
1,89,132,54,4.9
2,25,0,14,0.7
3,245,138,312,12.4
4,217,57,45,5.9
...,...,...,...,...
188,333,100,3,7.7
189,111,2,1,2.0
190,6,0,0,0.1
191,32,19,4,2.5
192,64,18,4,4.7

### Output

In [11]:
y = base.iloc[:, 0]

In [12]:
y

0      Afghanistan
1          Albania
2          Algeria
3          Andorra
4           Angola
          ...
188      Venezuela
189        Vietnam
190          Yemen
191         Zambia
192       Zimbabwe
Name: country, Length: 193, dtype: object

### Applying the model

Libraries:
- SKLEARN
- KNN

In [13]:
from sklearn.neighbors import KNeighborsClassifier

n_neighbors = k nearest neighbors
- neighbors numbers = 3
- odd in case of equals

In [14]:
knn = KNeighborsClassifier(n_neighbors=3)

### Fit function

The training algorithm
- input and output

In [15]:
knn.fit(X, y)

KNeighborsClassifier(n_neighbors=3)

In [16]:
KNeighborsClassifier

sklearn.neighbors._classification.KNeighborsClassifier

Given a sample

In [25]:
amostra = base.sample()

In [26]:
amostra

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
101,Malawi,8,11,1,1.5

In [27]:
amostra.iloc[:, 1:]

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
101,8,11,1,1.5

Predict!

In [28]:
knn.predict(amostra.iloc[:, 1:])

array(['Malawi'], dtype=object)

ACERTO MIZERAVI!